// Array дотор гараас орсон үг хэдэн ширхэг орсныг тоолдог алгоритм бичнэ үү.

// Шаардлага: том жижиг үсэг ялгахгүй тоолдог байх
// let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'байдалд', 'ийм', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'эргэлзээтэй', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];


// Input: нүүрс
// Output: нүүрс гэдэг үг 2 орсон байна.


let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'байдалд', 'ийм', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'эргэлзээтэй', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];
let srch=prompt('Enter searching value')
let count=0;
for(let i=0; i<data.length; i++){
    if (data[i].toLowerCase()==srch.toLowerCase()){
        count++
    }
}
console.log(srch + " gedeg ug " + count + " udaa orson baina.");